Revit 2024 API
ExternalGeometryId Constructor
 Constructs an ExternalGeometryId object holding the given external geometry identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public ExternalGeometryId(
	string externalGeometryId
)
Visual Basic
Public Sub New ( _
	externalGeometryId As String _
)
Visual C++
public:
ExternalGeometryId(
	String^ externalGeometryId
)
Parameters
externalGeometryId
Type: System.String
 A string that represents an identifier for an external geometry.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  externalGeometryId is not a valid ExternalGeometryId.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExternalGeometryId Class
Autodesk.Revit.DB Namespace